- python
    - variables - storing data
    - data types - *int float string* - string **list dictionary** sets range
    - functions - create resuable code, lots of lines of code in one place 
    - classes - help us containerise code, box things up, 

- libraries
    - numpy - **arrays** we can create matrices, numerical calculation
    - pandas - **DataFrames** store data like spread sheets, excel sheets, we can manipulate those tables.

- Machine Learning 
     - data - clean data, analyse data, play with data
     - feed to the machine
     - show the machine what is right, what is wrong (learns, creates its own patterns)
     - then you ask questions, and get answers

#### dictionaries???

- we will try to create a dictionary
- data types with keys and values

In [10]:
# create a small dictionary
# names of 4 students, and their marks

# key : value 

students = {
    "Idrees": 95,
    "Mel": 96,
    "Ibrahim":98
}

print(students)

# access elements
students["Ibrahim"]

{'Idrees': 95, 'Mel': 96, 'Ibrahim': 98}

98

In [ ]:
students_grades = {
    "name": ["Idrees","Mel","Ibrahim","Hazira","Amin","Nazri"],
    "maths":[90,90,90,92,94,94],
    "english": [90,90,90,92,94,94],
    "science": [90,90,90,92,94,94]
}

print(students_grades)

{'name': ['Idrees', 'Mel', 'Ibrahim', 'Hazira', 'Amin', 'Nazri'], 'maths': [90, 90, 90, 92, 94, 94], 'english': [90, 90, 90, 92, 94, 94], 'science': [90, 90, 90, 92, 94, 94]}

In [63]:
print(students_grades["maths"])

students_grades["name"][2] = "Aatirah"
students_grades["name"][2]

[90, 90, 90, 92, 94, 94]

'Aatirah'

In [51]:
# pip install pandas

In [52]:
import pandas as pd

df = pd.DataFrame(students_grades)

df
print("\n first table ------------\n",df,"\n")
print("\n second table ------------\n",df,)
print("\n third table ------------\n",df)

 first table ------------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94


 second table ------------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

 third table ------------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

In [53]:
type(df)

# numpy.ndarray

pandas.core.frame.DataFrame

In [ ]:
df.head() # top part of a df # 5 is the default argument
df.tail()

      name  maths  english  science
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

In [76]:
# we can access certain columns in dataframes too

print("\n Names column ------------\n",df["name"])
print("\n maths column ------------\n",df["maths"])
# print("\n maths column ------------\n",df["english"])
# print("\n maths column ------------\n",df["science"])

 Names column ------------
 0     Idrees
1        Mel
2    Aatirah
3     Hazira
4       Amin
5      Nazri
Name: name, dtype: object

 maths column ------------
 0    90
1    90
2    90
3    92
4    94
5    94
Name: maths, dtype: int64

In [80]:
import numpy as np
arrayyyy = np.array([])
type(arrayyyy)

numpy.ndarray

In [89]:
# series

marks_series = pd.Series([1,2,3,4,5], name= "maths")
# type(marks_series)

print(marks_series)

0    1
1    2
2    3
3    4
4    5
Name: maths, dtype: int64

In [93]:
df

      name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Aatirah     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

In [101]:
# how many marks does amin have in english?

english_amin = df["english"][4]

# print("In English Amin had 94 marks")

at = df["name"][2]
at_english = df["english"][2]

print(f" In English {at} had {at_english} marks")

# ------- "In English Aatirah had 90 marks"

# type(english)


haz = df["name"][3]
haz_maths = df["maths"][3]

print(f" In Maths {haz} had {haz_maths} marks")

 In English Aatirah had 90 marks
 In Maths Hazira had 92 marks

In [ ]:
# core data types we use in pandas?

# dataframe 
# series

### Create a series of data pd.series 5 values of temperature
### Create a Dataframe city and temperature - 5 cities

In [157]:
# series object - single columns, 1D columns

temp11 = pd.Series([32,31,50,34,-2])
print("type of temp11: ",type(temp11))


# a dictionary of temperatures
# python data object
temperatures = {
    "cities" : ["KL","HK","SG","NY","HLS"],
    "temp10" : [23,29,40,0,5]
}

# creating a dataframe
# dataframe is a pandas 
temp_df = pd.DataFrame(temperatures)
print("type of temp_df: ",type(temp_df))

print(temp_df)
print(temp11)


# temp_df ----> add day11 to this as well

type of temp11:  <class 'pandas.core.series.Series'>
type of temp_df:  <class 'pandas.core.frame.DataFrame'>
  cities  temp10
0     KL      23
1     HK      29
2     SG      40
3     NY       0
4    HLS       5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [153]:
type(temp_df["cities"])

pandas.core.series.Series

In [158]:
print(temp_df) # dataframe object
print(temp11)  # series object

  cities  temp10
0     KL      23
1     HK      29
2     SG      40
3     NY       0
4    HLS       5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [155]:
temp_df["cities"] = {} 
temp_df

  cities  temp10
0    NaN      23
1    NaN      29
2    NaN      40
3    NaN       0
4    NaN       5

In [159]:
# dataframe creates a column that does not exist
temp_df["temp11"] = temp11
temp_df

  cities  temp10  temp11
0     KL      23      32
1     HK      29      31
2     SG      40      50
3     NY       0      34
4    HLS       5      -2

In [160]:
temp_df["empty_temp"] = {}
temp_df

  cities  temp10  temp11 empty_temp
0     KL      23      32        NaN
1     HK      29      31        NaN
2     SG      40      50        NaN
3     NY       0      34        NaN
4    HLS       5      -2        NaN

In [161]:
temp_df["idreesRating"] = {}
temp_df

  cities  temp10  temp11 empty_temp idreesRating
0     KL      23      32        NaN          NaN
1     HK      29      31        NaN          NaN
2     SG      40      50        NaN          NaN
3     NY       0      34        NaN          NaN
4    HLS       5      -2        NaN          NaN

In [162]:
temp_df["ibrahimRating"] = {}
temp_df

  cities  temp10  temp11 empty_temp idreesRating ibrahimRating
0     KL      23      32        NaN          NaN           NaN
1     HK      29      31        NaN          NaN           NaN
2     SG      40      50        NaN          NaN           NaN
3     NY       0      34        NaN          NaN           NaN
4    HLS       5      -2        NaN          NaN           NaN

In [163]:
temp_df["melRating"] = {}
temp_df

  cities  temp10  temp11 empty_temp idreesRating ibrahimRating melRating
0     KL      23      32        NaN          NaN           NaN       NaN
1     HK      29      31        NaN          NaN           NaN       NaN
2     SG      40      50        NaN          NaN           NaN       NaN
3     NY       0      34        NaN          NaN           NaN       NaN
4    HLS       5      -2        NaN          NaN           NaN       NaN

In [164]:
temp_df["ibrahimRating"] = pd.Series([5,4,1,5,2])

In [167]:
temp_df["melRating"] = pd.Series([-1,5,4,2,3])
temp_df["idreesRating"] = pd.Series([5,3,3,3,3])

In [172]:
df = temp_df

In [171]:
# already a dataset?

# save this as a csv file??

temp_df.to_csv("City Rating without Row Numbers.csv", index=False)

In [179]:
data = {
    "cities" : ["KL","KL","KL","NY","HLS"],
    "temp10" : [23,29,40,0,5]
}

df = pd.DataFrame(data)
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [ ]:
df["cities"].value_counts() # occurences of a particular group/object/class

cities
KL     3
NY     1
HLS    1
Name: count, dtype: int64

In [181]:
# shop at 7 eleven often

# ibrahim
# ibrahim
# ibrahim
# ibrahim
# mel
# mel
# ibrahim
# idrees
# mel

In [182]:
df["cities"].unique()

array(['KL', 'NY', 'HLS'], dtype=object)

In [183]:
df["cities"].duplicated()

0    False
1     True
2     True
3    False
4    False
Name: cities, dtype: bool

In [188]:
df2 = df["cities"].drop_duplicates()
df2

0     KL
3     NY
4    HLS
Name: cities, dtype: object